tools/VPS.tex
% Created 2024-05-27 Mon 11:20
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{ctex}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.1 (Org mode 9.5.2)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

VPS服务商不仅提供了强大的计算资源和高安全性，而且通过支持加密货币支付，保障了硬核人民群众的隐私和匿名性，非常适合从事黑客研究、搭建翻墙环境和进行网络安全实验
\section{Hostinger}
\label{sec:org5ee7474}
\subsection{特点}
\label{sec:org78115fe}
提供全面的VPS控制，支持比特币、以太坊等加密货币支付。其高性能的Intel Xeon处理器和NVMe SSD存储非常适合需要高计算能力的应用，如运行复杂的翻墙工具和黑客实验环境。
\subsection{应用}
\label{sec:org3b9ad12}
可以用于搭建VPN、代理服务器，进行网络安全实验。
\subsection{URL}
\label{sec:org7d82852}
\url{https://hostinger.com}

\section{Cherry Servers}
\label{sec:orgad379fa}
\subsection{特点}
\label{sec:orga00de01}
提供灵活的计费选项，支持比特币、以太坊等多种加密货币支付。具备自动化服务器管理和DDoS保护，非常适合需要高安全性的应用。
\subsection{应用}
\label{sec:orgad9a2f6}
适合搭建高匿名性代理服务器、进行渗透测试实验。
\subsection{URL}
\label{sec:orgb02f060}
\url{https://cherryservers.com}

\section{HostSailor}
\label{sec:orgb7717f4}
\subsection{特点}
\label{sec:org551d92e}
价格实惠，支持比特币、以太坊等多种加密货币支付。其VPS服务包括OpenVZ、Xen和KVM虚拟化选项，并提供额外的DDoS保护服务。
\subsection{应用}
\label{sec:org8865562}
适合个人和小型团队进行网络安全实验和翻墙应用开发。
\subsection{URL}
\label{sec:orgb63ce23}
\url{https://clients.hostsailor.com}

\section{Cloudzy}
\label{sec:orgbffaab9}
\subsection{特点}
\label{sec:orgd930c1a}
提供99.95\%的正常运行时间和24/7客户支持，支持多种加密货币支付。全球15个以上的数据中心位置提供低延迟和高可靠性，非常适合需要全球覆盖的应用。
\subsection{应用}
\label{sec:orgc2f21f1}
适用于搭建全球分布的VPN网络和进行跨区域网络安全研究。
\subsection{URL}
\label{sec:org3948784}
\url{https://cloudzy.com}

\section{BitLaunch}
\label{sec:org5466cd7}
\subsection{特点}
\label{sec:orgffa39f9}
与DigitalOcean、Vultr和Linode合作，提供多种操作系统选择，包括Linux和Windows，支持比特币等多种加密货币支付。提供一键安装隐私工具和DDoS保护。
\subsection{应用}
\label{sec:orgc892cf1}
非常适合搭建高匿名性的网络环境、进行隐私保护和安全研究。
\subsection{URL}
\label{sec:org4b36850}
\url{https://bitlaunch.io}


\section{逗比根据地}
\label{sec:org054550e}
涵盖shandowsocks，v2ray，WireGuard 等使用搭建教程，以及各种VPN，VPS，虚拟主机资源，Linux使用教程等等等等。适合小白到高玩各个阶层。爱折腾的玩家可以走过路过看一看。
\subsection{URL}
\label{sec:orgf9e5af9}
\url{https://doubibackup.com}
\subsection{Github}
\label{sec:orga4e5964}
\url{https://github.com/Alvin9999/new-pac/tree/master}

\section{资源宝藏导航网站: 叛逆草}
\label{sec:org5eb3bff}
资源宝藏导航网站: 叛逆草
在这里，你可以找到各种实用工具，满足你的需求。不管是日常生活还是工作学习，都有相应的工具等你来发掘！
提供一些 工具、影音、网盘、软件、办公、娱乐 等相关资源，挺不错，可以当浏览器主页使用。
\subsection{URL}
\label{sec:org744f53e}
\url{https://www.pncao.com/}

\section{Docker}
\label{sec:orge96ad56}
\url{https://docker.easydoc.net/doc/81170005/cCewZWoN/lTKfePfP}


\section{BlockChain}
\label{sec:org69e94ce}
Awesome-Blockchain-CN：全面的区块链学习与开发资源汇总
项目旨在收集和整理与区块链相关的优秀资源和工具。该项目包括了区块链的入门资料、开发工具、开源项目、技术论文和教程等，适合各个层次的开发者和研究人员。
\begin{enumerate}
\item 入门资源：包括区块链的基础知识、教程和相关书籍，帮助初学者快速了解区块链技术。
\item 开发工具：包含了各种区块链开发工具和框架，如Truffle、Ganache、Remix等，帮助开发者更方便地进行区块链开发。
\item 开源项目：列举了多个优秀的开源区块链项目和平台，如比特币、以太坊、Hyperledger等，供开发者参考和学习。
\item 技术论文：收集了大量区块链相关的学术论文和研究报告，帮助研究人员了解区块链技术的最新进展和应用。
\item 教程和文章：整理了各类关于区块链的教程和技术文章，涵盖从基础知识到高级应用的各个方面。
\end{enumerate}
\subsection{URL}
\label{sec:orgf261783}
\url{https://github.com/chaozh/awesome-blockchain-cn}
\subsection{Path}
\label{sec:org2a6e926}
\section{Cloudflare+Trojan}
\label{sec:org4b77d32}
\subsection{Cloudflare Worker搭建Trojan节点}
\label{sec:org814168c}
\url{https://www.youtube.com/watch?v=MBlAqYajVSY}
\subsection{Trojan 节点添加优选订阅+定制专属选优订阅}
\label{sec:org716d133}
\url{https://www.youtube.com/watch?v=jOhq3QpXG\_I}
\end{document}